import requests
from urllib.parse import urljoin
from base.spider import Spider

class Spider(Spider):
    # 初始化
    def init(self, extend=''):
        self.siteUrl = 'https://api.yuafeng.cn'
        self.author = ['一一系列', '一个富贵', '一依然然', '一只九岁', '一只仙女', '一只偷猪', '一头鱼系', '一字马系', '一小甜甜', '一板栗栗', '一根忧郁', '一梦幻蛋', '七七系列', '七崽仔秋', '万万生日', '三星小凛', '三月大理', '三月系列', '不会飞的', '不吃姣姣', '不吃露拖', '不哉香菜', '不困系列', '不太迷人', '不怪兽系', '不是坨坨', '不是小玫', '不是米五', '不饿不饿', '丝哇女神', '两只叉烧', '丹妮熊熊', '丽丽酱系', '乌梅子酱', '乏乏乏了', '乔乔无语', '井川里予', '京都念慈', '人善变妻', '什么卡比', '仓鼠莓酱', '仙女养花', '仙女宝宝', '仙女府系', '以哦哦你', '任智桃系', '伊言系列', '何丹彤系', '余儿系列', '余多多系', '佛要早睡', '你叫什么', '你哦系列', '你好烦呐', '你妮老师', '你朱大哥', '你派大萱', '你爱小狗', '你现视研', '你的卷子', '你的晓艺', '你的欲梦', '佳佳好困', '佳佳拖把', '佳诺系列', '依然然系', '保护溪溪', '俺来了宝', '偷猪系列', '傅立青系', '允允系列', '允禾系列', '兔娘系列', '兔心心系', '兔没烦恼', '兔田系列', '八柏系列', '关东小熊', '养条雅狗', '写不来马', '冰快递灵', '冷酷系列', '凡爱卓区', '刀小刀飒', '刘二萌系', '别曹曹了', '动漫桃桃', '努力西鱼', '北北系列', '十一系列', '半斤八梁', '卑香狗子', '卓一楠版', '南恬系列', '南风系列', '占有御系', '卡哇伊哦', '卡尔系列', '去你尤尼', '去你系列', '反派小虫', '发财糯米', '口口蜜细', '只小璐崽', '只要小懿', '叫我小张', '叭宝系列', '可可同学', '可可西哦', '吃了个迟x', '吃火龙果', '各位阿哥', '吉上海路', '名媛系列', '吧啦鲨系', '吱吱子耶', '呆呆啊系', '呆小系列', '呆涵系列', '周末愉快', '周沁柠系', '和小树系', '咪咪系列', '咬口奶忧', '哎呀白菜', '哦纯哦纯', '啊宝贝系', '啵奇塔系', '喝喝阔落', '喝白开水', '喵了个咪', '喵喵咪系', '嗯呐多么', '嘉欣系列', '嘟嘟大晶', '嘟嘟酱系', '噜噜不困', '困困贝贝', '困笨猫系', '圈大魔王', '在下悟空', '复仇学姐', '夜听系列', '大大欢系', '大大系列', '大板牙系', '大林系列', '大鹅减肥', '天仙阁哦', '失眠豆包', '奈圆滚滚', '奈奈雪阿', '女变少妇', '女王妹妹', '奶油逃跑', '奶瑶妹妹', '奶瑶妹子', '奶瓶不甜', '奶糖系列', '奶糖芭比', '奶茶因子', '奶酱系列', '好肥君系', '如烟大帝', '妇女系列', '妙卡呀系', '妤老师系', '妲己系列', '妹妹发财', '妹子美哒', '妻漆子系', '姐妹一起', '姜姜饼饼', '姜正姬系', '姜镜系列', '娇妻系列', '婆娘婆娘', '婉婉系列', '婉清系列', '婧婧系列', '媚娘系列', '媚娘系系', '媛妹系列', '宁子来咯', '安利系列', '安知鱼系', '宋幻月系', '宝少奶奶', '宸荨樱桃', '宿命恋人', '富儿系列', '小乖系列', '小亦大王', '小仙系列', '小何何系', '小偶像系', '小元系列', '小兔啵啵', '小兔睡了', '小兔睡了1', '小刘饱了', '小十一系', '小千禧系', '小唐系列', '小团嫂系', '小困老师', '小埋呆瓜', '小奶系系', '小娜宝宝', '小婷婷兔', '小宣睡噜', '小小九天', '小曲同学', '小李胖了', '小柔睡神', '小梨花系', '小橙子哦', '小正义忒', '小歪歪', '小泽美子', '小炉球系', '小熊好冷', '小熊妹妹', '小熊衩子', '小猪曈系', '小猫纯情', '小玉系列', '小甜酒子', '小程同学', '小箱子鸭', '小羊偏偏', '小羊栗系', '小羊系列', '小苏不困', '小萝卜区', '小赵赵哦', '小赵赵系', '小透明系', '小金橘系', '小锦鲤系', '小雅系列', '小零同学', '小青系列', '小饼干干', '小馒系列', '小马漫漫', '小鲤系列', '屑度子系', '山水的林', '山猫学姐', '左姐系列', '左教坊系', '巫祝系列', '巴旦公主', '帆仔贫困', '干妈水饺', '幻月系列', '幼梨酱系', '序言系列', '废话超多', '康的甜心', '开心仔系', '张不胖了', '彬彬来了', '彭十六系', '彭雅琦系', '很多系列', '徐艺洋系', '御萝刀刀', '微醺学姐', '心情好好', '心碎小猫', '心碎小甜', '心许系列', '忙碌一天', '忧郁小情', '快手用户', '快落梦想', '念念系列', '思思系列', '思甜系列', '思黑神话', '怪的兽兽', '恬恬系列', '悦崽系列', '悦颜悦已', '想你写信', '慕慕奶糖', '憨桃人儿', '我在德令', '我才是哈', '我是小雨', '抹茶布丁', '抹茶系列', '拿自己的', '捕梦网儿', '提苦茶子', '摄影小龙', '摸摸鱼哦', '新好幸运', '方圆系列', '无需要你', '早安圆源', '早安圆系', '明惠菜菜', '易梦玲系', '星狗系列', '昭昭困了', '是丹丹吖.', '是南系列', '是卫星吗', '是小七呀', '是小念噢', '是小朱吖', '是小欣少', '是小甜宠', '是小系列', '是恋爱脑', '是熊小姐', '是猪猪侠', '是盈妹系', '是笛笛牙', '是诺拉来', '是雨波波', '晕辣系列', '晴天晴天', '晴天系列', '暖似阳系', '暖暖系列', '暴躁老卓', '曲奇菌系', '有声系列', '有甜妹妹', '有红烧鱼', '木公主区', '木子笙箫', '木糖醇系', '未音酱系', '朴智娜系', '机智咩咩', '机谁不爱', '杀猪饲料', '权系列呀', '李了系列', '李娜婚纱', '李李好甜', '李欣桐系', '李渝嫣系', '李美兮系', '李诗雅哦', '李逍遥嗷', '杨百万系', '松坂砂糖', '林一允系', '林南学姐', '林可可系', '果丹皮系', '果茶噗噗', '枫贴系列', '柔软夫夫', '柔软系列', '柚夏墨颜', '柚子好酸', '柳如烟区', '柴郡郡主', '栗川芥系', '桂花酒酿', '桃桃系列', '桃泽纱奈', '梁琪清系', '梦几个游.', '梦娢系列', '梦玥可系', '梨涡圆点', '梭子系列', '棒棒酱哦', '楚涵系列', '模糊系列', '橙子皮系', '次元摄影', '欣欣系列', '欣欣超甜', '欣然姐姐', '欣老板系', '殊兰系列', '水粥系列', '永远系列', '汐尔吖系', '汐尔系列', '汐总系列', '池小苡系', '池澄系列', '没吃早餐', '治不开心', '泡泡困了', '泡泡芙系', '泡泡袖系', '泡泡酱系', '波浪海苔', '洛洛酱紫', '洛酱紫系', '浣熊统领', '涂画戴上', '淇淇正妹', '深依姐姐', '深藏系列', '清许系列', '温柚系列', '游小鱼宝', '潮流星雨', '火只木南', '烟花是花', '烤雪糕系', '煎妮系列', '照烧鸡排', '熊大小姐', '熊暴尼系', '熊爱吃鱼', '爪子系列', '爱可可西', '爱奴系列', '爱白系列', '爱童话嗯', '爱花露水', '牙牙乐乐', '牙牙外号', '牛次小虫', '牛角包系', '狗头军师', '狸妹系列', '狼宝系列', '狼牙豆饼', '猛羊羊系', '猪猪啵系', '猪猪小野', '猪猪霞系', '猫七系列', '猫姨系列', '猫子好困', '猫猫好困', '玉米小姐', '王昭君哦', '玥心儿区', '玥野兔兔', '玻璃罐系', '珍哥系列', '球球你啦', '琰琰琰系', '瑜丫头哦', '瑞尔系列', '瑶瑶仙女', '甜七七系', '甜桃奶芙', '甜辣小源', '甜长系列', '电气老鼠', '略略学姐', '痱子哭哭', '白眠系列', '百香楼系', '的林系列', '监控欧克', '直女小陈', '相扑猫系', '瞳在干嘛', '知名友酥', '知名美女', '知知系列', '石神千梨', '硝子系列', '碎碎系列', '神秘阁系', '程哟哦哦', '程崽儿童', '空心柚七', '章若系列', '章若雨林', '章鱼童谣', '童锣烧系', '笔号界外', '筱箫系列', '米亚泽系', '米叮系列', '米线线喵', '粉红骡子', '粒粒堡系', '粥不喝粥', '粥粥系列', '糕冷小羊', '紫氯氯系', '絕色系列', '红糖糍粑', '纯情崽崽a', '绘梨衣系', '绘梨香系', '给你芒果', '绝代系列', '维维子系', '绷带系列', '绿小林子', '网图系列', '罩不住系', '羊偏偏系', '羊小羊系', '羊毛卷卷', '美了个滢', '美大宝系', '美女沈熙', '美好时光', '羽宝宝系', '聪丽系列', '肉巴很干', '肉肉怡系', '胖子系列', '胖子系列1', '胡可欣系', '胡桃泽系', '脑斧系列', '脱缰凯系', '腿祖宗安', '艾乐乐吖', '芊芊龍系', '芊语芊寻', '芋泥肉包', '芝士喵喵', '芦荟胶系', '芫伯伯系', '芯宝系列', '花月岚系', '花有误哦', '花碎花系', '花西系列', '苏不是酥', '苏子秋系', '苏打小团', '苏苏老婆', '若叶若叶', '若琳系列', '茶茶系列', '草稿本爱', '草莓酸奶', '荔枝甜心', '荔枝莓莓', '莉莉子拉', '莓烦恼妹', '莱茵克蓝', '莹莹崽宝', '莹莹系列', '菜不透你', '菜芽儿系', '菜菜系列', '萌可酱系', '萧萧吃辣', '萱不败系', '董花苗苗', '葱花怪兽', '蒙多护啊', '蒙多护士', '蒲一彤系', '蒸汽咩系', '蓄意系列', '蓝蓝同学', '蔓蔓饿了', '蔡文姬系', '薛薛系列', '薰讯系列', '藏弓系列', '蛋儿系列', '蛋儿迷妹', '蛋宝大人', '蛋炒饭系', '蛋蛋梦系', '蜡笔小熙', '衡冰雪系', '被渣男骗', '褚美慧哦', '西兰花系', '西施系列', '诗颖系列', '话烦人精', '豆鲨包哦', '豚豚系列', '貂蝉系列', '贝勒儿区', '贫困看看', '赛尖尖系', '赫宜系列', '走路摇了', '赵可欣哈', '赵喵喵喵', '赵小七区', '赵小七系', '起床小萌', '超软肉元', '跑跑酸奶', '软小糖哦', '轻音阁系', '达不妞系', '连蜜系列', '迟迟系列', '迷糊蛇系', '逍遥呱呱', '逗你蟹蟹', '邱颖儿系', '酥酥八系', '酱系系列', '酷野系列', '里十七呀', '重新系列', '金嘟嘟系', '金姝妍系', '金毛地鼠', '金泰妍系', '锅炉殿下', '闪耀溪溪', '闻歌系列', '阿尔忒弥', '阿帆系列', '阿洋系列', '阿鹿系列', '陈倾系列', '陈在干嘛', '陈怡晨系', '陈诺系列', '陌小喵酱', '陌生小喵', '陌陌系列', '雀奴系列', '雅婷直播', '雅萌系列', '雍灵儿哦', '雨萱宝贝', '雪嘤系列', '雪柔不醒', '雪莉达系', '霜降系列', '露露饱了', '鞠婧祎系', '韩冰系列', '领养头猪', '颜值系列', '颜兮兮哦', '颜开系列', '风知我意', '风轻轻吹', '风韵犹存', '饭饭点酷', '饼干姐姐', '饼饼大王', '饿晕系列', '香皂泡系', '香菜姨妈', '马雪系列', '高冷冷系', '魔术师哦', '鱼茶系列', '鱼鱼系列', '鲜虫系列', '鸣呜呜呜', '鹿八岁虎', '鹿鹿系列', '麦香鸡块', '麻将周周', '麻瓜混剪', '麻辣烫醋', '黄二系列', '黄奕系列', '黄星星系', '黑沢樱里', '黑色闪光', '黑魔仙系', '黑黑草梅', '鼠不知么', '龙特蕾莎', '龙门石窟']
        # self.pic = 'https://api.uumnet.com/api/mn1.php?'
        # self.pic = 'https://api.yuafeng.cn/API/ly/bizhi.php?'
        # self.pic = 'https://api.yuafeng.cn/API/dnbz/api.php?'
        self.pic = 'https://api.yuafeng.cn/API/ecr/api.php?'
        # self.pic = 'https://api.yuafeng.cn/API/ly/ttf/wztw.php?text='

    # 主页分类
    def homeContent(self, filter):
        classes = []
        for i in self.author:
            classes.append({
                'type_name': i,
                'type_id': i
            })
        return {'class': classes}

    # 主页视频内容
    def homeVideoContent(self):
        lists = []
        lists = [
            {"vod_id":"井川里予","vod_name":"646598267","vod_pic":"http://q2.qlogo.cn/headimg_dl?bs=qq&dst_uin=646598267&spec=100","vod_remarks":"作者QQ"},
            {"vod_id":"仙女宝宝","vod_name":"1002469838","vod_pic":"https://p.qlogo.cn/gh/1002469838/1002469838/100","vod_remarks":"更新Q群"}
        ]
        for i in self.author:
            lists.append({
                'vod_id': i,
                'vod_name': i,
                'vod_pic': self.pic + i,
                'vod_remarks': ''
            })
        return {'list': lists}

    # 分类内容
    def categoryContent(self, tid, pg, filter, extend):
        lists = []
        lists = [{
            'vod_id': tid,
            'vod_name': tid,
            'vod_pic': self.pic + tid,
            'vod_remarks': ''
        }]
        pagecount = 1
        limit = len(lists)
        total = pagecount * limit
        return {'list':lists, 'pagecount':pagecount, 'page':pg, 'limit':limit, 'total':total}

    # 搜索内容
    def searchContent(self, key, quick, pg='1'):
        pass

    # 详情内容
    def detailContent(self, ids):
        vod_play_url = []
        for i in range(1, 51):
            vod_play_url.append(
                f'{i}${ids[0]}&t={i}'
            )
        lists = [{
            'vod_id': ids[0],
            'vod_name': ids[0],
            'vod_pic': self.pic + ids[0],
            'vod_remarks': '',
            'vod_content': '随机小姐姐',
            'vod_play_from': '看吧你就',
            'vod_play_url': '#'.join(vod_play_url)
        }]
        return {'list': lists}

    # 播放器内容
    def playerContent(self, flag, vid, vip_flags):
        url = f'{self.siteUrl}/API/spxl/api.php?series={vid}&urltype=redirect'
        response = requests.get(url=url, allow_redirects=False, timeout=10)
        location = response.headers.get('Location')
        if location:
            playurl = urljoin(url, location)
        else:
            playurl = url
        return {'jx': 0, 'parse': 0, 'url': playurl}

    def getName(self):
        pass

    def isVideoFormat(self, url):
        pass

    def manualVideoCheck(self):
        pass

    def destroy(self):
        pass

    def localProxy(self, param):
        pass